app/Modules/Produk/Models/ProdukModel.php

SELECT `produk`.*
FROM `produk`
JOIN `kategori` ON `kategori`.`id` = `produk`.`kategori_id`
---
    public function getAllData()
    {
        return $this->db->table($this->table)
            ->select('produk.*', 'kategori.nama_kategori')
            ->join('kategori', 'kategori.id = produk.kategori_id')
            ->get()
            ->getResultArray();

SELECT `produk`.*
FROM `produk`
JOIN `kategori` ON `kategori`.`id` = `produk`.`kategori_id`
WHERE `produk`.`id` = '2'
---
    public function getDataById($id)
    {
        return $this->db->table($this->table)
            ->select('produk.*', 'kategori.nama_kategori as nama_kategori')
            ->join('kategori', 'kategori.id = produk.kategori_id')
            ->where('produk.id', $id)
            ->get()
            ->getResultArray();